app/views/welcome/index.haml

  %ul.plans
    - Plan.all.each do |p|
---
SELECT `plans`.* FROM `plans`