app/controllers/accounts_controller.rb

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 1 LIMIT 1
---
  def new
    @plan = Plan.find_by_id(params[:plan_id])

INSERT INTO `accounts` (`created_at`, `domain`, `name`, `plan_id`, `updated_at`) VALUES ('2011-09-26 23:39:51', 'quavio', 'Quavio', NULL, '2011-09-26 23:39:51')
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 2 LIMIT 1
---
  def create
    @account = Account.new params[:account]
    if @account.save
      flash[:notice] = 'Sua conta foi criada com sucesso!'
      redirect_to root_path
    else
      @plan = Plan.find_by_id(params[:plan_id])